In [118]:
import pandas as pd
cars = pd.read_csv('cars.csv')#reads the excel file
print("The first five rows are: \n",   cars.head()) #prints first 5 rows
print("The last five rows are: \n", cars.tail()) #prints last 5 rows

cars.to_csv('Maitim_Pandas-P1.py') #prints to a csv file or excel file

The first five rows are:
                Model   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  \
0          Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4
1      Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4
2         Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4
3     Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3
4  Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3

   carb
0     4
1     4
2     1
3     1
4     2
The last five rows are:
              Model   mpg  cyl   disp   hp  drat     wt  qsec  vs  am  gear  \
27    Lotus Europa  30.4    4   95.1  113  3.77  1.513  16.9   1   1     5
28  Ford Pantera L  15.8    8  351.0  264  4.22  3.170  14.5   0   1     5
29    Ferrari Dino  19.7    6  145.0  175  3.62  2.770  15.5   0   1     5
30   Maserati Bora  15.0    8  301.0  335  3.54  3.570  14.6   0   1     5
31      Volvo 142E  21.4    4  121.0  109  4.11  2.780  18.6   1   1     4

    carb
27     2
28     4
29     6
30     8
31     2

In [120]:
car = cars.iloc[:5,::2] #selects the first 5 rows of the dataframe, skips every 2 columns to get the odd number
car #prints the odd numbers rows

               Model  cyl   hp     wt  vs  gear
0          Mazda RX4    6  110  2.620   0     4
1      Mazda RX4 Wag    6  110  2.875   0     4
2         Datsun 710    4   93  2.320   1     4
3     Hornet 4 Drive    6  110  3.215   1     3
4  Hornet Sportabout    8  175  3.440   0     3

In [130]:
cars.loc[cars['Model']=='Mazda RX4'] #prints the row of Mazda RX4

       Model   mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
0  Mazda RX4  21.0    6  160.0  110   3.9  2.62  16.46   0   1     4     4

In [124]:
cars.loc[cars['Model']== 'Camaro Z28', ['Model','cyl']] #prints the dataframe of the model Camayo Z28 and the cyl 8

         Model  cyl
23  Camaro Z28    8

In [126]:
models = ['Mazda RX4 Wag', 'Ford Pantera L', 'Honda Civic'] #put in a list of the needed to find models
column = ['Model','cyl','gear'] #puts in a list of what should be included in the row
for model in models: #for loop to find each models
    x = cars.loc[cars['Model'] == model, column] #locates the car model with the arguments
    print(x) #prints the car model, cyl, and gear.

           Model  cyl  gear
1  Mazda RX4 Wag    6     4
             Model  cyl  gear
28  Ford Pantera L    8     5
          Model  cyl  gear
18  Honda Civic    4     4